zephyrproject-rtos/hal_microchip/pic32c/pic32cm_gc_sg/pic32cm_gc00/include/pio/pic32cm5112gc00064.h
#define PIN_PA08B_ADC_ADC0_ANN4                    _UINT32_(8) 
#define MUX_PA08B_ADC_ADC0_ANN4                    _UINT32_(1) 
#define PINMUX_PA08B_ADC_ADC0_ANN4                 ((PIN_PA08B_ADC_ADC0_ANN4 << 16) | MUX_PA08B_ADC_ADC0_ANN4)
#define PORT_PA08B_ADC_ADC0_ANN4                   (_UINT32_(1) << 8)

/* ================== PORT definition for CAN0 peripheral =================== */
#define PIN_PA10H_CAN0_RX                          _UINT32_(10)
#define MUX_PA10H_CAN0_RX                          _UINT32_(7) 
#define PINMUX_PA10H_CAN0_RX                       ((PIN_PA10H_CAN0_RX << 16) | MUX_PA10H_CAN0_RX)
#define PORT_PA10H_CAN0_RX                         (_UINT32_(1) << 10)

#define PIN_PC01H_CAN0_RX                          _UINT32_(65)
#define MUX_PC01H_CAN0_RX                          _UINT32_(7) 
#define PINMUX_PC01H_CAN0_RX                       ((PIN_PC01H_CAN0_RX << 16) | MUX_PC01H_CAN0_RX)
#define PORT_PC01H_CAN0_RX                         (_UINT32_(1) << 1)

#define PIN_PD06H_CAN0_RX                          _UINT32_(102)
#define MUX_PD06H_CAN0_RX                          _UINT32_(7) 
#define PINMUX_PD06H_CAN0_RX                       ((PIN_PD06H_CAN0_RX << 16) | MUX_PD06H_CAN0_RX)
#define PORT_PD06H_CAN0_RX                         (_UINT32_(1) << 6)

#define PIN_PA11H_CAN0_TX                          _UINT32_(11)
#define MUX_PA11H_CAN0_TX                          _UINT32_(7) 
#define PINMUX_PA11H_CAN0_TX                       ((PIN_PA11H_CAN0_TX << 16) | MUX_PA11H_CAN0_TX)
#define PORT_PA11H_CAN0_TX                         (_UINT32_(1) << 11)

#define PIN_PC02H_CAN0_TX                          _UINT32_(66)
#define MUX_PC02H_CAN0_TX                          _UINT32_(7) 
#define PINMUX_PC02H_CAN0_TX                       ((PIN_PC02H_CAN0_TX << 16) | MUX_PC02H_CAN0_TX)
#define PORT_PC02H_CAN0_TX                         (_UINT32_(1) << 2)

#define PIN_PD08H_CAN0_TX                          _UINT32_(104)
#define MUX_PD08H_CAN0_TX                          _UINT32_(7) 
#define PINMUX_PD08H_CAN0_TX                       ((PIN_PD08H_CAN0_TX << 16) | MUX_PD08H_CAN0_TX)
#define PORT_PD08H_CAN0_TX                         (_UINT32_(1) << 8)

/* ================== PORT definition for CAN1 peripheral =================== */
#define PIN_PA00H_CAN1_RX                          _UINT32_(0) 
#define MUX_PA00H_CAN1_RX                          _UINT32_(7) 
#define PINMUX_PA00H_CAN1_RX                       ((PIN_PA00H_CAN1_RX << 16) | MUX_PA00H_CAN1_RX)
#define PORT_PA00H_CAN1_RX                         (_UINT32_(1) << 0)

#define PIN_PC05H_CAN1_RX                          _UINT32_(69)
#define MUX_PC05H_CAN1_RX                          _UINT32_(7) 
#define PINMUX_PC05H_CAN1_RX                       ((PIN_PC05H_CAN1_RX << 16) | MUX_PC05H_CAN1_RX)
#define PORT_PC05H_CAN1_RX                         (_UINT32_(1) << 5)

#define PIN_PD12H_CAN1_RX                          _UINT32_(108)
#define MUX_PD12H_CAN1_RX                          _UINT32_(7) 
#define PINMUX_PD12H_CAN1_RX                       ((PIN_PD12H_CAN1_RX << 16) | MUX_PD12H_CAN1_RX)
#define PORT_PD12H_CAN1_RX                         (_UINT32_(1) << 12)

#define PIN_PA01H_CAN1_TX                          _UINT32_(1) 
#define MUX_PA01H_CAN1_TX                          _UINT32_(7) 
#define PINMUX_PA01H_CAN1_TX                       ((PIN_PA01H_CAN1_TX << 16) | MUX_PA01H_CAN1_TX)
#define PORT_PA01H_CAN1_TX                         (_UINT32_(1) << 1)

#define PIN_PC06H_CAN1_TX                          _UINT32_(70)
#define MUX_PC06H_CAN1_TX                          _UINT32_(7) 
#define PINMUX_PC06H_CAN1_TX                       ((PIN_PC06H_CAN1_TX << 16) | MUX_PC06H_CAN1_TX)
#define PORT_PC06H_CAN1_TX                         (_UINT32_(1) << 6)

#define PIN_PD13H_CAN1_TX                          _UINT32_(109)
#define MUX_PD13H_CAN1_TX                          _UINT32_(7) 
#define PINMUX_PD13H_CAN1_TX                       ((PIN_PD13H_CAN1_TX << 16) | MUX_PD13H_CAN1_TX)
#define PORT_PD13H_CAN1_TX                         (_UINT32_(1) << 13)

/* ================== PORT definition for CCL0 peripheral =================== */
#define PIN_PC01I_CCL0_IN0                         _UINT32_(65)
#define MUX_PC01I_CCL0_IN0                         _UINT32_(8) 
#define PINMUX_PC01I_CCL0_IN0                      ((PIN_PC01I_CCL0_IN0 << 16) | MUX_PC01I_CCL0_IN0)
#define PORT_PC01I_CCL0_IN0                        (_UINT32_(1) << 1)

#define PIN_PC02I_CCL0_IN1                         _UINT32_(66)
#define MUX_PC02I_CCL0_IN1                         _UINT32_(8) 
#define PINMUX_PC02I_CCL0_IN1                      ((PIN_PC02I_CCL0_IN1 << 16) | MUX_PC02I_CCL0_IN1)
#define PORT_PC02I_CCL0_IN1                        (_UINT32_(1) << 2)

#define PIN_PC09I_CCL0_IN2                         _UINT32_(73)
#define MUX_PC09I_CCL0_IN2                         _UINT32_(8) 
#define PINMUX_PC09I_CCL0_IN2                      ((PIN_PC09I_CCL0_IN2 << 16) | MUX_PC09I_CCL0_IN2)
#define PORT_PC09I_CCL0_IN2                        (_UINT32_(1) << 9)

#define PIN_PD00I_CCL0_IN3                         _UINT32_(96)
#define MUX_PD00I_CCL0_IN3                         _UINT32_(8) 
#define PINMUX_PD00I_CCL0_IN3                      ((PIN_PD00I_CCL0_IN3 << 16) | MUX_PD00I_CCL0_IN3)
#define PORT_PD00I_CCL0_IN3                        (_UINT32_(1) << 0)

#define PIN_PD01I_CCL0_IN4                         _UINT32_(97)
#define MUX_PD01I_CCL0_IN4                         _UINT32_(8) 
#define PINMUX_PD01I_CCL0_IN4                      ((PIN_PD01I_CCL0_IN4 << 16) | MUX_PD01I_CCL0_IN4)
#define PORT_PD01I_CCL0_IN4                        (_UINT32_(1) << 1)

#define PIN_PD10I_CCL0_IN5                         _UINT32_(106)
#define MUX_PD10I_CCL0_IN5                         _UINT32_(8) 
#define PINMUX_PD10I_CCL0_IN5                      ((PIN_PD10I_CCL0_IN5 << 16) | MUX_PD10I_CCL0_IN5)
#define PORT_PD10I_CCL0_IN5                        (_UINT32_(1) << 10)

#define PIN_PA00I_CCL0_IN6                         _UINT32_(0) 
#define MUX_PA00I_CCL0_IN6                         _UINT32_(8) 
#define PINMUX_PA00I_CCL0_IN6                      ((PIN_PA00I_CCL0_IN6 << 16) | MUX_PA00I_CCL0_IN6)
#define PORT_PA00I_CCL0_IN6                        (_UINT32_(1) << 0)

#define PIN_PA01I_CCL0_IN7                         _UINT32_(1) 
#define MUX_PA01I_CCL0_IN7                         _UINT32_(8) 
#define PINMUX_PA01I_CCL0_IN7                      ((PIN_PA01I_CCL0_IN7 << 16) | MUX_PA01I_CCL0_IN7)
#define PORT_PA01I_CCL0_IN7                        (_UINT32_(1) << 1)

#define PIN_PA10I_CCL0_IN8                         _UINT32_(10)
#define MUX_PA10I_CCL0_IN8                         _UINT32_(8) 
#define PINMUX_PA10I_CCL0_IN8                      ((PIN_PA10I_CCL0_IN8 << 16) | MUX_PA10I_CCL0_IN8)
#define PORT_PA10I_CCL0_IN8                        (_UINT32_(1) << 10)

#define PIN_PB05I_CCL0_IN9                         _UINT32_(37)
#define MUX_PB05I_CCL0_IN9                         _UINT32_(8) 
#define PINMUX_PB05I_CCL0_IN9                      ((PIN_PB05I_CCL0_IN9 << 16) | MUX_PB05I_CCL0_IN9)
#define PORT_PB05I_CCL0_IN9                        (_UINT32_(1) << 5)

#define PIN_PB06I_CCL0_IN10                        _UINT32_(38)
#define MUX_PB06I_CCL0_IN10                        _UINT32_(8) 
#define PINMUX_PB06I_CCL0_IN10                     ((PIN_PB06I_CCL0_IN10 << 16) | MUX_PB06I_CCL0_IN10)
#define PORT_PB06I_CCL0_IN10                       (_UINT32_(1) << 6)

#define PIN_PB10I_CCL0_IN11                        _UINT32_(42)
#define MUX_PB10I_CCL0_IN11                        _UINT32_(8) 
#define PINMUX_PB10I_CCL0_IN11                     ((PIN_PB10I_CCL0_IN11 << 16) | MUX_PB10I_CCL0_IN11)
#define PORT_PB10I_CCL0_IN11                       (_UINT32_(1) << 10)

#define PIN_PC03I_CCL0_OUT0                        _UINT32_(67)
#define MUX_PC03I_CCL0_OUT0                        _UINT32_(8) 
#define PINMUX_PC03I_CCL0_OUT0                     ((PIN_PC03I_CCL0_OUT0 << 16) | MUX_PC03I_CCL0_OUT0)
#define PORT_PC03I_CCL0_OUT0                       (_UINT32_(1) << 3)

#define PIN_PD08I_CCL0_OUT1                        _UINT32_(104)
#define MUX_PD08I_CCL0_OUT1                        _UINT32_(8) 
#define PINMUX_PD08I_CCL0_OUT1                     ((PIN_PD08I_CCL0_OUT1 << 16) | MUX_PD08I_CCL0_OUT1)
#define PORT_PD08I_CCL0_OUT1                       (_UINT32_(1) << 8)

#define PIN_PA02I_CCL0_OUT2                        _UINT32_(2) 
#define MUX_PA02I_CCL0_OUT2                        _UINT32_(8) 
#define PINMUX_PA02I_CCL0_OUT2                     ((PIN_PA02I_CCL0_OUT2 << 16) | MUX_PA02I_CCL0_OUT2)
#define PORT_PA02I_CCL0_OUT2                       (_UINT32_(1) << 2)

