zephyrproject-rtos/hal_microchip/pic32c/pic32cm_gc_sg/pic32cm_gc00/include/pio/pic32cm5112gc00064.h
#define PIN_PA08P_PTC_PTCXY12                      _UINT32_(8) 
#define MUX_PA08P_PTC_PTCXY12                      _UINT32_(15)
#define PINMUX_PA08P_PTC_PTCXY12                   ((PIN_PA08P_PTC_PTCXY12 << 16) | MUX_PA08P_PTC_PTCXY12)
#define PORT_PA08P_PTC_PTCXY12                     (_UINT32_(1) << 8)

#define PIN_PA09P_PTC_PTCXY13                      _UINT32_(9) 
#define MUX_PA09P_PTC_PTCXY13                      _UINT32_(15)
#define PINMUX_PA09P_PTC_PTCXY13                   ((PIN_PA09P_PTC_PTCXY13 << 16) | MUX_PA09P_PTC_PTCXY13)
#define PORT_PA09P_PTC_PTCXY13                     (_UINT32_(1) << 9)

#define PIN_PB00P_PTC_PTCXY14                      _UINT32_(32)
#define MUX_PB00P_PTC_PTCXY14                      _UINT32_(15)
#define PINMUX_PB00P_PTC_PTCXY14                   ((PIN_PB00P_PTC_PTCXY14 << 16) | MUX_PB00P_PTC_PTCXY14)
#define PORT_PB00P_PTC_PTCXY14                     (_UINT32_(1) << 0)

#define PIN_PB03P_PTC_PTCXY15                      _UINT32_(35)
#define MUX_PB03P_PTC_PTCXY15                      _UINT32_(15)
#define PINMUX_PB03P_PTC_PTCXY15                   ((PIN_PB03P_PTC_PTCXY15 << 16) | MUX_PB03P_PTC_PTCXY15)
#define PORT_PB03P_PTC_PTCXY15                     (_UINT32_(1) << 3)

#define PIN_PB04P_PTC_PTCXY16                      _UINT32_(36)
#define MUX_PB04P_PTC_PTCXY16                      _UINT32_(15)
#define PINMUX_PB04P_PTC_PTCXY16                   ((PIN_PB04P_PTC_PTCXY16 << 16) | MUX_PB04P_PTC_PTCXY16)
#define PORT_PB04P_PTC_PTCXY16                     (_UINT32_(1) << 4)

#define PIN_PB05P_PTC_PTCXY17                      _UINT32_(37)
#define MUX_PB05P_PTC_PTCXY17                      _UINT32_(15)
#define PINMUX_PB05P_PTC_PTCXY17                   ((PIN_PB05P_PTC_PTCXY17 << 16) | MUX_PB05P_PTC_PTCXY17)
#define PORT_PB05P_PTC_PTCXY17                     (_UINT32_(1) << 5)

#define PIN_PB06P_PTC_PTCXY18                      _UINT32_(38)
#define MUX_PB06P_PTC_PTCXY18                      _UINT32_(15)
#define PINMUX_PB06P_PTC_PTCXY18                   ((PIN_PB06P_PTC_PTCXY18 << 16) | MUX_PB06P_PTC_PTCXY18)
#define PORT_PB06P_PTC_PTCXY18                     (_UINT32_(1) << 6)

#define PIN_PC00P_PTC_PTCXY19                      _UINT32_(64)
#define MUX_PC00P_PTC_PTCXY19                      _UINT32_(15)
#define PINMUX_PC00P_PTC_PTCXY19                   ((PIN_PC00P_PTC_PTCXY19 << 16) | MUX_PC00P_PTC_PTCXY19)
#define PORT_PC00P_PTC_PTCXY19                     (_UINT32_(1) << 0)

#define PIN_PC01P_PTC_PTCXY20                      _UINT32_(65)
#define MUX_PC01P_PTC_PTCXY20                      _UINT32_(15)
#define PINMUX_PC01P_PTC_PTCXY20                   ((PIN_PC01P_PTC_PTCXY20 << 16) | MUX_PC01P_PTC_PTCXY20)
#define PORT_PC01P_PTC_PTCXY20                     (_UINT32_(1) << 1)

#define PIN_PC02P_PTC_PTCXY21                      _UINT32_(66)
#define MUX_PC02P_PTC_PTCXY21                      _UINT32_(15)
#define PINMUX_PC02P_PTC_PTCXY21                   ((PIN_PC02P_PTC_PTCXY21 << 16) | MUX_PC02P_PTC_PTCXY21)
#define PORT_PC02P_PTC_PTCXY21                     (_UINT32_(1) << 2)

#define PIN_PA10P_PTC_PTCXY22                      _UINT32_(10)
#define MUX_PA10P_PTC_PTCXY22                      _UINT32_(15)
#define PINMUX_PA10P_PTC_PTCXY22                   ((PIN_PA10P_PTC_PTCXY22 << 16) | MUX_PA10P_PTC_PTCXY22)
#define PORT_PA10P_PTC_PTCXY22                     (_UINT32_(1) << 10)

#define PIN_PA11P_PTC_PTCXY23                      _UINT32_(11)
#define MUX_PA11P_PTC_PTCXY23                      _UINT32_(15)
#define PINMUX_PA11P_PTC_PTCXY23                   ((PIN_PA11P_PTC_PTCXY23 << 16) | MUX_PA11P_PTC_PTCXY23)
#define PORT_PA11P_PTC_PTCXY23                     (_UINT32_(1) << 11)

#define PIN_PA12P_PTC_PTCXY24                      _UINT32_(12)
#define MUX_PA12P_PTC_PTCXY24                      _UINT32_(15)
#define PINMUX_PA12P_PTC_PTCXY24                   ((PIN_PA12P_PTC_PTCXY24 << 16) | MUX_PA12P_PTC_PTCXY24)
#define PORT_PA12P_PTC_PTCXY24                     (_UINT32_(1) << 12)

#define PIN_PA13P_PTC_PTCXY25                      _UINT32_(13)
#define MUX_PA13P_PTC_PTCXY25                      _UINT32_(15)
#define PINMUX_PA13P_PTC_PTCXY25                   ((PIN_PA13P_PTC_PTCXY25 << 16) | MUX_PA13P_PTC_PTCXY25)
#define PORT_PA13P_PTC_PTCXY25                     (_UINT32_(1) << 13)

#define PIN_PB07P_PTC_PTCXY26                      _UINT32_(39)
#define MUX_PB07P_PTC_PTCXY26                      _UINT32_(15)
#define PINMUX_PB07P_PTC_PTCXY26                   ((PIN_PB07P_PTC_PTCXY26 << 16) | MUX_PB07P_PTC_PTCXY26)
#define PORT_PB07P_PTC_PTCXY26                     (_UINT32_(1) << 7)

#define PIN_PB08P_PTC_PTCXY27                      _UINT32_(40)
#define MUX_PB08P_PTC_PTCXY27                      _UINT32_(15)
#define PINMUX_PB08P_PTC_PTCXY27                   ((PIN_PB08P_PTC_PTCXY27 << 16) | MUX_PB08P_PTC_PTCXY27)
#define PORT_PB08P_PTC_PTCXY27                     (_UINT32_(1) << 8)

#define PIN_PB09P_PTC_PTCXY28                      _UINT32_(41)
#define MUX_PB09P_PTC_PTCXY28                      _UINT32_(15)
#define PINMUX_PB09P_PTC_PTCXY28                   ((PIN_PB09P_PTC_PTCXY28 << 16) | MUX_PB09P_PTC_PTCXY28)
#define PORT_PB09P_PTC_PTCXY28                     (_UINT32_(1) << 9)

#define PIN_PB10P_PTC_PTCXY29                      _UINT32_(42)
#define MUX_PB10P_PTC_PTCXY29                      _UINT32_(15)
#define PINMUX_PB10P_PTC_PTCXY29                   ((PIN_PB10P_PTC_PTCXY29 << 16) | MUX_PB10P_PTC_PTCXY29)
#define PORT_PB10P_PTC_PTCXY29                     (_UINT32_(1) << 10)

#define PIN_PC09P_PTC_PTCXY30                      _UINT32_(73)
#define MUX_PC09P_PTC_PTCXY30                      _UINT32_(15)
#define PINMUX_PC09P_PTC_PTCXY30                   ((PIN_PC09P_PTC_PTCXY30 << 16) | MUX_PC09P_PTC_PTCXY30)
#define PORT_PC09P_PTC_PTCXY30                     (_UINT32_(1) << 9)

#define PIN_PC10P_PTC_PTCXY31                      _UINT32_(74)
#define MUX_PC10P_PTC_PTCXY31                      _UINT32_(15)
#define PINMUX_PC10P_PTC_PTCXY31                   ((PIN_PC10P_PTC_PTCXY31 << 16) | MUX_PC10P_PTC_PTCXY31)
#define PORT_PC10P_PTC_PTCXY31                     (_UINT32_(1) << 10)

/* ================= PORT definition for SERCOM0 peripheral ================= */
#define PIN_PC00D_SERCOM0_PAD0                     _UINT32_(64)
#define MUX_PC00D_SERCOM0_PAD0                     _UINT32_(3) 
#define PINMUX_PC00D_SERCOM0_PAD0                  ((PIN_PC00D_SERCOM0_PAD0 << 16) | MUX_PC00D_SERCOM0_PAD0)
#define PORT_PC00D_SERCOM0_PAD0                    (_UINT32_(1) << 0)

#define PIN_PC01D_SERCOM0_PAD1                     _UINT32_(65)
#define MUX_PC01D_SERCOM0_PAD1                     _UINT32_(3) 
#define PINMUX_PC01D_SERCOM0_PAD1                  ((PIN_PC01D_SERCOM0_PAD1 << 16) | MUX_PC01D_SERCOM0_PAD1)
#define PORT_PC01D_SERCOM0_PAD1                    (_UINT32_(1) << 1)

