zephyrproject-rtos/hal_microchip/pic32c/pic32cm_gc_sg/pic32cm_gc00/include/pio/pic32cm5112gc00064.h
/* ================== PORT definition for TCC5 peripheral =================== */
#define PIN_PD10F_TCC5_WO0                         _UINT32_(106)
#define MUX_PD10F_TCC5_WO0                         _UINT32_(5) 
#define PINMUX_PD10F_TCC5_WO0                      ((PIN_PD10F_TCC5_WO0 << 16) | MUX_PD10F_TCC5_WO0)
#define PORT_PD10F_TCC5_WO0                        (_UINT32_(1) << 10)

#define PIN_PD09F_TCC5_WO0                         _UINT32_(105)
#define MUX_PD09F_TCC5_WO0                         _UINT32_(5) 
#define PINMUX_PD09F_TCC5_WO0                      ((PIN_PD09F_TCC5_WO0 << 16) | MUX_PD09F_TCC5_WO0)
#define PORT_PD09F_TCC5_WO0                        (_UINT32_(1) << 9)

#define PIN_PA00F_TCC5_WO1                         _UINT32_(0) 
#define MUX_PA00F_TCC5_WO1                         _UINT32_(5) 
#define PINMUX_PA00F_TCC5_WO1                      ((PIN_PA00F_TCC5_WO1 << 16) | MUX_PA00F_TCC5_WO1)
#define PORT_PA00F_TCC5_WO1                        (_UINT32_(1) << 0)

#define PIN_PD11F_TCC5_WO1                         _UINT32_(107)
#define MUX_PD11F_TCC5_WO1                         _UINT32_(5) 
#define PINMUX_PD11F_TCC5_WO1                      ((PIN_PD11F_TCC5_WO1 << 16) | MUX_PD11F_TCC5_WO1)
#define PORT_PD11F_TCC5_WO1                        (_UINT32_(1) << 11)

/* ================== PORT definition for TCC6 peripheral =================== */
#define PIN_PA01F_TCC6_WO0                         _UINT32_(1) 
#define MUX_PA01F_TCC6_WO0                         _UINT32_(5) 
#define PINMUX_PA01F_TCC6_WO0                      ((PIN_PA01F_TCC6_WO0 << 16) | MUX_PA01F_TCC6_WO0)
#define PORT_PA01F_TCC6_WO0                        (_UINT32_(1) << 1)

#define PIN_PD12F_TCC6_WO0                         _UINT32_(108)
#define MUX_PD12F_TCC6_WO0                         _UINT32_(5) 
#define PINMUX_PD12F_TCC6_WO0                      ((PIN_PD12F_TCC6_WO0 << 16) | MUX_PD12F_TCC6_WO0)
#define PORT_PD12F_TCC6_WO0                        (_UINT32_(1) << 12)

#define PIN_PA02F_TCC6_WO1                         _UINT32_(2) 
#define MUX_PA02F_TCC6_WO1                         _UINT32_(5) 
#define PINMUX_PA02F_TCC6_WO1                      ((PIN_PA02F_TCC6_WO1 << 16) | MUX_PA02F_TCC6_WO1)
#define PORT_PA02F_TCC6_WO1                        (_UINT32_(1) << 2)

#define PIN_PD13F_TCC6_WO1                         _UINT32_(109)
#define MUX_PD13F_TCC6_WO1                         _UINT32_(5) 
#define PINMUX_PD13F_TCC6_WO1                      ((PIN_PD13F_TCC6_WO1 << 16) | MUX_PD13F_TCC6_WO1)
#define PORT_PD13F_TCC6_WO1                        (_UINT32_(1) << 13)

/* =================== PORT definition for USB peripheral =================== */
#define PIN_PD01H_USB_SOF                          _UINT32_(97)
#define MUX_PD01H_USB_SOF                          _UINT32_(7) 
#define PINMUX_PD01H_USB_SOF                       ((PIN_PD01H_USB_SOF << 16) | MUX_PD01H_USB_SOF)
#define PORT_PD01H_USB_SOF                         (_UINT32_(1) << 1)

#define PIN_PD02H_USB_USBDM                        _UINT32_(98)
#define MUX_PD02H_USB_USBDM                        _UINT32_(7) 
#define PINMUX_PD02H_USB_USBDM                     ((PIN_PD02H_USB_USBDM << 16) | MUX_PD02H_USB_USBDM)
#define PORT_PD02H_USB_USBDM                       (_UINT32_(1) << 2)

#define PIN_PD03H_USB_USBDP                        _UINT32_(99)
#define MUX_PD03H_USB_USBDP                        _UINT32_(7) 
#define PINMUX_PD03H_USB_USBDP                     ((PIN_PD03H_USB_USBDP << 16) | MUX_PD03H_USB_USBDP)
#define PORT_PD03H_USB_USBDP                       (_UINT32_(1) << 3)



#endif /* _PIC32CM5112GC00064_GPIO_H_ */

